Учет_документов_20.ДокументыИТорги/src/Documents/РасшДТ_ТОРГИ/РасшДТ_ТОРГИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасшДТ_ТОРГИ</name>
  <registerRecords>InformationRegister.РасшДТ_ТоргиВРаботе</registerRecords>
  <registerRecords>InformationRegister.РасшДТ_ДанныеОСтоимостиЧасаНаТоргах</registerRecords>
  <registerRecords>AccumulationRegister.РасшДТ_ОборотыПоТоргам</registerRecords>
  <attributes>
    <name>СостояниеЗакупки</name>
    <type>
      <types>EnumRef.РасшДТ_СостоянияЗакупки</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионОказанияУслуг</name>
    <type>
      <types>CatalogRef.РасшДТ_РегионыОказанияУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НашКлиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметЗакупки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗакупки</name>
    <type>
      <types>CatalogRef.РасшДТ_СпособыЗакупки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПодачиЗаявок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БыстрыеТорги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТоргов</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляТоргов</name>
    <type>
      <types>CatalogRef.РасшДТ_ВидыПлощадокДляТоргов</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОказанияКонсультаций</name>
    <type>
      <types>EnumRef.РасшДТ_УсловияОказанияКонсультаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Безлимит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧасаНачальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧасаИтоговая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КтоНазначилМинимальнуюЦену</name>
    <type>
      <types>CatalogRef.РасшДТ_НашиСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНачальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоКакойЦеныМожноСнижать</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоИтогамТоргов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаСБИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПлощадку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПроигрышаТоргов</name>
    <type>
      <types>EnumRef.РасшДТ_ПричиныПроигрышаТоргов</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоВыигралТорги</name>
    <type>
      <types>CatalogRef.РасшДТ_Конкуренты</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоСбилЦену</name>
    <type>
      <types>CatalogRef.РасшДТ_Конкуренты</types>
    </type>
  </attributes>
</mdclass:Document>

Учет_документов_20.ДокументыИТорги/src/Documents/РасшДТ_ТОРГИ/ManagerModule.bsl
// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура ИнформацияДляЧатаВБитриксе(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ИнформацияДляЧатаВБитриксе)
	Макет = Документы.РасшДТ_ТОРГИ.ПолучитьМакет("ИнформацияДляЧатаВБитриксе");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТОРГИ.Заказчик,
		|	ТОРГИ.ПредметЗакупки,
		|	ТОРГИ.СуммаНачальная,
		|	ТОРГИ.СсылкаНаПлощадку,
		|	ТОРГИ.ОкончаниеПодачиЗаявок,
		|	ТОРГИ.БыстрыеТорги
		|ИЗ
		|	Документ.РасшДТ_ТОРГИ КАК ТОРГИ
		|ГДЕ
		|	ТОРГИ.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка = Макет.ПолучитьОбласть("Шапка");
	БыстрыеТорги = Макет.ПолучитьОбласть("БыстрыеТорги");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		Шапка.Параметры.Заполнить(Выборка);
		Если (Выборка.БыстрыеТорги) Тогда
			ТабДок.Вывести(БыстрыеТорги);
		КонецЕсли;
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
